name: "faces"
platform: "tensorflow_graphdef"
max_batch_size: 8

input [
    {
        name: "img_inputs"
        data_type: TYPE_FP32
        dims: [112, 112, 3 ]
    },
    {
        name: "dropout_rate"
        data_type: TYPE_FP32
        dims: [ 1 ]
    }
]
output [
   {
      name: "resnet_v1_50/E_BN2/Identity"
      data_type: TYPE_FP32
      dims: [ 100 ]
      label_filename: "labels.txt"
   }
]
instance_group [
   {
      kind: KIND_GPU
      count: 1
      gpus: [ 0 ]
   }
]

